STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA25CE/Applications/BLE/BLE_ESL/STM32_WPAN/App/app_ble.c
          ESLSHandleNotification.EvtOpcode = ESLS_CONN_HANDLE_EVT;
          DISHandleNotification.EvtOpcode = DIS_CONN_HANDLE_EVT;
          ESLSHandleNotification.ConnectionHandle = p_enhanced_conn_complete->Connection_Handle;
          DISHandleNotification.ConnectionHandle = p_enhanced_conn_complete->Connection_Handle;
          ESLS_APP_EvtRx(&ESLSHandleNotification);
          DIS_APP_EvtRx(&DISHandleNotification);
          ESL_APP_ConnectionComplete(p_enhanced_conn_complete->Connection_Handle,
                                     p_enhanced_conn_complete->Sync_Handle,
                                     p_enhanced_conn_complete->Peer_Address_Type,
                                     p_enhanced_conn_complete->Peer_Address);
          UTIL_TIMER_Stop(&(bleAppContext.TimerAdvLowPower_Id));
          break;
        } /* HCI_LE_ENHANCED_CONNECTION_COMPLETE_V2_SUBEVT_CODE */
        case HCI_LE_PERIODIC_ADVERTISING_SYNC_TRANSFER_RECEIVED_V2_SUBEVT_CODE:
        {
          hci_le_periodic_advertising_sync_transfer_received_v2_event_rp0 *p_periodic_adv_sync_transfer_rec_v2;
          p_periodic_adv_sync_transfer_rec_v2 = (hci_le_periodic_advertising_sync_transfer_received_v2_event_rp0 *) p_meta_evt->data;
          
          LOG_INFO_APP("HCI_LE_PERIODIC_ADVERTISING_SYNC_TRANSFER_RECEIVED_V2\n");
          
          if(p_periodic_adv_sync_transfer_rec_v2->Status == 0)
          {
            ESL_APP_SyncInfoReceived(p_periodic_adv_sync_transfer_rec_v2->Sync_Handle);
          }
          else
          {
            LOG_INFO_APP("Status %02X\n", p_periodic_adv_sync_transfer_rec_v2->Status);
          }
          break;
        } /* HCI_LE_PERIODIC_ADVERTISING_SYNC_TRANSFER_RECEIVED_V2_SUBEVT_CODE */
        
      case HCI_LE_PERIODIC_ADVERTISING_REPORT_V2_SUBEVT_CODE:
        {
          hci_le_periodic_advertising_report_v2_event_rp0 *p_periodic_adv_report_v2;
          p_periodic_adv_report_v2 = (hci_le_periodic_advertising_report_v2_event_rp0 *)p_meta_evt->data;
          
          if(p_periodic_adv_report_v2->Data_Status == HCI_PADV_DATA_STATUS_COMPLETE && p_periodic_adv_report_v2->Data_Length != 0)
          {
            ESL_APP_AdvPayloadReceived(p_periodic_adv_report_v2->Periodic_Event_Counter, p_periodic_adv_report_v2->Data, p_periodic_adv_report_v2->Data_Length);
          }
          break;
        } /* HCI_LE_PERIODIC_ADVERTISING_REPORT_V2_SUBEVT_CODE */
      case HCI_LE_PERIODIC_ADVERTISING_SYNC_LOST_SUBEVT_CODE:
        {
          hci_le_periodic_advertising_sync_lost_event_rp0 *p_periodic_adv_sync_lost_event;
          p_periodic_adv_sync_lost_event = (hci_le_periodic_advertising_sync_lost_event_rp0 *)p_meta_evt->data;
          UNUSED(p_periodic_adv_sync_lost_event);
          
          LOG_INFO_APP("HCI_LE_PERIODIC_ADVERTISING_SYNC_LOST\n");
          
          bleAppContext.Device_Connection_Status = APP_BLE_IDLE;
          
          ESL_APP_SyncLost();
          
          break;
        } /* HCI_LE_PERIODIC_ADVERTISING_SYNC_LOST_SUBEVT_CODE */
        
        /* USER CODE END SUBEVENT */
        default:
        {
          LOG_DEBUG_BLE("SVCCTL_App_Notification: unhandled SUBEVENT with opcode: 0x%02X\n", p_meta_evt->subevent);
          /* USER CODE BEGIN SUBEVENT_DEFAULT */
          
          /* USER CODE END SUBEVENT_DEFAULT */
          break;
        }
      }

      /* USER CODE BEGIN META_EVT */

      /* USER CODE END META_EVT */
    }
    break; /* HCI_LE_META_EVT_CODE */

    case HCI_VENDOR_SPECIFIC_DEBUG_EVT_CODE:
    {
      p_blecore_evt = (evt_blecore_aci*) p_event_pckt->data;
      /* USER CODE BEGIN EVT_VENDOR */

      /* USER CODE END EVT_VENDOR */
      switch (p_blecore_evt->ecode)
      {
        /* USER CODE BEGIN ECODE */

        /* USER CODE END ECODE */
        case ACI_L2CAP_CONNECTION_UPDATE_RESP_VSEVT_CODE:
        {
          aci_l2cap_connection_update_resp_event_rp0 *p_l2cap_conn_update_resp;
          p_l2cap_conn_update_resp = (aci_l2cap_connection_update_resp_event_rp0 *) p_blecore_evt->data;
          UNUSED(p_l2cap_conn_update_resp);
          /* USER CODE BEGIN EVT_L2CAP_CONNECTION_UPDATE_RESP */

          /* USER CODE END EVT_L2CAP_CONNECTION_UPDATE_RESP */
          break;
        }
        case ACI_GAP_PROC_COMPLETE_VSEVT_CODE:
        {
          aci_gap_proc_complete_event_rp0 *p_gap_proc_complete;
          p_gap_proc_complete = (aci_gap_proc_complete_event_rp0*) p_blecore_evt->data;
          UNUSED(p_gap_proc_complete);

          LOG_INFO_APP(">>== ACI_GAP_PROC_COMPLETE_VSEVT_CODE\n");
          /* USER CODE BEGIN EVT_GAP_PROCEDURE_COMPLETE */

          /* USER CODE END EVT_GAP_PROCEDURE_COMPLETE */
          break; /* ACI_GAP_PROC_COMPLETE_VSEVT_CODE */
        }
        case ACI_HAL_END_OF_RADIO_ACTIVITY_VSEVT_CODE:
        {
          /* USER CODE BEGIN RADIO_ACTIVITY_EVENT */

          /* USER CODE END RADIO_ACTIVITY_EVENT */
          break; /* ACI_HAL_END_OF_RADIO_ACTIVITY_VSEVT_CODE */
        }
        case ACI_GAP_PASS_KEY_REQ_VSEVT_CODE:
        {
          uint32_t pin;
          LOG_INFO_APP(">>== ACI_GAP_PASS_KEY_REQ_VSEVT_CODE\n");

          pin = BLE_DEFAULT_PIN;
          /* USER CODE BEGIN ACI_GAP_PASS_KEY_REQ_VSEVT_CODE_0 */

          /* USER CODE END ACI_GAP_PASS_KEY_REQ_VSEVT_CODE_0 */

          ret = aci_gap_pass_key_resp(bleAppContext.connectionHandle, pin);
          if (ret != BLE_STATUS_SUCCESS)
          {
            LOG_INFO_APP("==>> aci_gap_pass_key_resp : Fail, reason: 0x%02X\n", ret);
          }
          else
          {
            LOG_INFO_APP("==>> aci_gap_pass_key_resp : Success\n");
          }
          /* USER CODE BEGIN ACI_GAP_PASS_KEY_REQ_VSEVT_CODE */

          /* USER CODE END ACI_GAP_PASS_KEY_REQ_VSEVT_CODE */
          break;
        }
        case ACI_GAP_NUMERIC_COMPARISON_VALUE_VSEVT_CODE:
        {
          uint8_t confirm_value;
          LOG_INFO_APP(">>== ACI_GAP_NUMERIC_COMPARISON_VALUE_VSEVT_CODE\n");
          LOG_INFO_APP("     - numeric_value = %ld\n",
                      ((aci_gap_numeric_comparison_value_event_rp0 *)(p_blecore_evt->data))->Numeric_Value);
          LOG_INFO_APP("     - Hex_value = %lx\n",
                      ((aci_gap_numeric_comparison_value_event_rp0 *)(p_blecore_evt->data))->Numeric_Value);

          /* Set confirm value to 1(YES) */
          confirm_value = 1;
          /* USER CODE BEGIN ACI_GAP_NUMERIC_COMPARISON_VALUE_VSEVT_CODE_0 */

          /* USER CODE END ACI_GAP_NUMERIC_COMPARISON_VALUE_VSEVT_CODE_0 */

