STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA25CE/Applications/BLE/BLE_ESL/STM32_WPAN/App/app_ble.c
          ret = aci_gap_numeric_comparison_value_confirm_yesno(bleAppContext.connectionHandle, confirm_value);
          if (ret != BLE_STATUS_SUCCESS)
          {
            LOG_INFO_APP("==>> aci_gap_numeric_comparison_value_confirm_yesno : Fail, reason: 0x%02X\n", ret);
          }
          else
          {
            LOG_INFO_APP("==>> aci_gap_numeric_comparison_value_confirm_yesno : Success\n");
          }
          /* USER CODE BEGIN ACI_GAP_NUMERIC_COMPARISON_VALUE_VSEVT_CODE */

          /* USER CODE END ACI_GAP_NUMERIC_COMPARISON_VALUE_VSEVT_CODE */
          break;
        }
        case ACI_GAP_PAIRING_COMPLETE_VSEVT_CODE:
        {
          LOG_INFO_APP(">>== ACI_GAP_PAIRING_COMPLETE_VSEVT_CODE\n");
          aci_gap_pairing_complete_event_rp0 *p_pairing_complete;
          p_pairing_complete = (aci_gap_pairing_complete_event_rp0*)p_blecore_evt->data;

          if (p_pairing_complete->Status != 0)
          {
            LOG_INFO_APP("     - Pairing KO\n     - Status: 0x%02X\n     - Reason: 0x%02X\n",
                         p_pairing_complete->Status, p_pairing_complete->Reason);
          }
          else
          {
            LOG_INFO_APP("     - Pairing Success\n");
          }
          LOG_INFO_APP("\n");

          /* USER CODE BEGIN ACI_GAP_PAIRING_COMPLETE_VSEVT_CODE */
          if (p_pairing_complete->Status == 0)
          {
            ESL_APP_PairingComplete(p_pairing_complete->Connection_Handle);
          } 
          /* USER CODE END ACI_GAP_PAIRING_COMPLETE_VSEVT_CODE */
          break;
        }
        case ACI_GATT_INDICATION_VSEVT_CODE:
        {
          aci_gatt_indication_event_rp0 *p_gatt_indication_event;
          LOG_INFO_APP(">>== ACI_GATT_INDICATION_VSEVT_CODE\n");

          p_gatt_indication_event = (aci_gatt_indication_event_rp0*)p_blecore_evt->data;

          /* USER CODE BEGIN ACI_GATT_INDICATION_VSEVT_CODE_0 */

          /* USER CODE END ACI_GATT_INDICATION_VSEVT_CODE_0 */

          ret = aci_gatt_confirm_indication(p_gatt_indication_event->Connection_Handle);
          if (ret != BLE_STATUS_SUCCESS)
          {
            LOG_INFO_APP("  Fail   : aci_gatt_confirm_indication command, result: 0x%02X\n", ret);
          }
          else
          {
            LOG_INFO_APP("  Success: aci_gatt_confirm_indication command\n");
          }
          /* USER CODE BEGIN ACI_GATT_INDICATION_VSEVT_CODE_1 */

          /* USER CODE END ACI_GATT_INDICATION_VSEVT_CODE_1 */
          break;
        }
        case ACI_GAP_BOND_LOST_VSEVT_CODE:
        {
          uint16_t conn_hdl;

          LOG_INFO_APP(">>== ACI_GAP_BOND_LOST_EVENT\n");
          conn_hdl = bleAppContext.connectionHandle;
          /* USER CODE BEGIN ACI_GAP_BOND_LOST_VSEVT_CODE_0 */

          /* USER CODE END ACI_GAP_BOND_LOST_VSEVT_CODE_0 */
          ret = aci_gap_allow_rebond(conn_hdl);
          if (ret != BLE_STATUS_SUCCESS)
          {
            LOG_INFO_APP("==>> aci_gap_allow_rebond : Fail, reason: 0x%02X\n", ret);
          }
          else
          {
            LOG_INFO_APP("==>> aci_gap_allow_rebond : Success\n");
          }
          /* USER CODE BEGIN ACI_GAP_BOND_LOST_VSEVT_CODE */

          /* USER CODE END ACI_GAP_BOND_LOST_VSEVT_CODE */
          break;
        }
        case ACI_WARNING_VSEVT_CODE:
        {
          aci_warning_event_rp0 *p_fw_warning_event;

          p_fw_warning_event = (aci_warning_event_rp0 *)p_blecore_evt->data;
          UNUSED(p_fw_warning_event);
          LOG_INFO_APP(">>== ACI_WARNING_VSEVT_CODE\n");
          LOG_INFO_APP("FW warning Type = 0x%02X\n", p_fw_warning_event->Warning_Type);
          /* USER CODE BEGIN ACI_HAL_FW_ERROR_VSEVT_CODE */

          /* USER CODE END ACI_HAL_FW_ERROR_VSEVT_CODE */
          break;
        }
        /* USER CODE BEGIN ECODE_1 */
        case ACI_GAP_PAIRING_REQUEST_VSEVT_CODE:
        {
          LOG_INFO_APP(">>== ACI_GAP_PAIRING_REQUEST_VSEVT_CODE\n");
          aci_gap_pairing_request_event_rp0 *p_event;
          p_event = (aci_gap_pairing_request_event_rp0*)p_blecore_evt->data;
          
          ESL_APP_PairingRequest(p_event->Connection_Handle);
          
          break;
        }
        case ACI_L2CAP_COC_CONNECT_VSEVT_CODE:
        {
          aci_l2cap_coc_connect_event_rp0 *p_l2cap_coc_connection;
          p_l2cap_coc_connection = (aci_l2cap_coc_connect_event_rp0 *) p_blecore_evt->data;
          
          tBleStatus ret;
          uint16_t result;
          uint8_t Channel_Number;
          
          LOG_INFO_APP(">>== ACI_L2CAP_COC_CONNECT_VSEVT_CODE\n");
          LOG_INFO_APP("SPSM: 0x%04X\nMTU: %d\nMPS: %d\nChannel_Number: %d\n", 
                      p_l2cap_coc_connection->SPSM, 
                      p_l2cap_coc_connection->MTU, 
                      p_l2cap_coc_connection->MPS,
                      p_l2cap_coc_connection->Channel_Number);
          
          if(p_l2cap_coc_connection->Channel_Number != 1)
          {
            LOG_ERROR_APP("Unexpected L2CAP channel request\n");
            result = L2CAP_CONN_FAIL_INSUFFICIENT_RESOURCES;
          }
          else if(p_l2cap_coc_connection->SPSM != SPSM_OTS)
          {
            LOG_ERROR_APP("Unexpected SPSM\n");
            result = L2CAP_CONN_FAIL_SPSM_NOT_SUPPORTED;
          }
          else
          { 
            result = L2CAP_CONN_SUCCESSFUL;
          }
          
          ret = aci_l2cap_coc_connect_confirm(p_l2cap_coc_connection->Connection_Handle,
                                              MAX_SDU_LENGTH,
                                              CFG_BLE_COC_MPS_MAX,
                                              2,
                                              result,
                                              1,
                                              &Channel_Number,
                                              &bleAppContext.L2CAP_ChIdx);
          if(ret != BLE_STATUS_SUCCESS)
          {
            LOG_ERROR_APP("==>> aci_l2cap_coc_connect_confirm : Fail, reason: 0x%02X\n", ret);
            
            break;
          } 
          else 
          {
            LOG_DEBUG_APP("==>> aci_l2cap_coc_connect_confirm : Success\n");
          }
          
