STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA25CE/Applications/BLE/BLE_ESL/STM32_WPAN/App/app_ble.c
          if(result == L2CAP_CONN_SUCCESSFUL)
          {
            OTS_APP_L2CAPChannelOpened(p_l2cap_coc_connection->Connection_Handle, bleAppContext.L2CAP_ChIdx);            
          }
          
          break;
        }
        case ACI_L2CAP_COC_DISCONNECT_VSEVT_CODE:
        {
          LOG_INFO_APP(">>== ACI_L2CAP_COC_DISCONNECT_VSEVT_CODE\n");
          OTS_APP_L2CAPChannelClosed();
          break;
        }
        case ACI_L2CAP_COC_RX_DATA_VSEVT_CODE:
        {
          LOG_DEBUG_APP(">>== ACI_L2CAP_COC_RX_DATA_VSEVT_CODE\n");
          aci_l2cap_coc_rx_data_event_rp0 *p_l2cap_coc_rx_data;
          p_l2cap_coc_rx_data = (aci_l2cap_coc_rx_data_event_rp0 *) p_blecore_evt->data;
          LOG_DEBUG_APP("Data Length: %d, Channel_Index: 0x%02X\n", p_l2cap_coc_rx_data->Length, p_l2cap_coc_rx_data->Channel_Index);
          
          if(bleAppContext.L2CAP_SduLength == 0)
          {
            /* First frame */
            bleAppContext.L2CAP_SduLength = LE_TO_HOST_16(p_l2cap_coc_rx_data->Data);
            if(bleAppContext.L2CAP_SduLength > MAX_SDU_LENGTH || p_l2cap_coc_rx_data->Length - 2 > MAX_SDU_LENGTH)
            {
              LOG_ERROR_APP("Error: SDU Length: %d PDU Length: %d\n", bleAppContext.L2CAP_SduLength, p_l2cap_coc_rx_data->Length - 2);
              aci_l2cap_coc_disconnect(bleAppContext.L2CAP_ChIdx);
              break;
            }
            memcpy(bleAppContext.L2CAP_SduBuff, p_l2cap_coc_rx_data->Data + 2,  p_l2cap_coc_rx_data->Length - 2);
            bleAppContext.L2CAP_RcvdSduLength = p_l2cap_coc_rx_data->Length - 2;
          }
          else
          {
            /* Following frames */
            if(bleAppContext.L2CAP_RcvdSduLength + p_l2cap_coc_rx_data->Length > MAX_SDU_LENGTH)
            {
              LOG_ERROR_APP("Error: PDU Length: %d\n", p_l2cap_coc_rx_data->Length);
              aci_l2cap_coc_disconnect(bleAppContext.L2CAP_ChIdx);
              break;
            }
            memcpy(bleAppContext.L2CAP_SduBuff+bleAppContext.L2CAP_RcvdSduLength, p_l2cap_coc_rx_data->Data,  p_l2cap_coc_rx_data->Length);
            bleAppContext.L2CAP_RcvdSduLength += p_l2cap_coc_rx_data->Length;
          }
          
          if(bleAppContext.L2CAP_RcvdSduLength == bleAppContext.L2CAP_SduLength)
          {
            /* Complete SDU received */
            OTS_APP_L2CAPDataReceived(bleAppContext.L2CAP_SduLength, bleAppContext.L2CAP_SduBuff);
            
            bleAppContext.L2CAP_SduLength = 0;
            bleAppContext.L2CAP_RcvdSduLength = 0;
          }
          
          aci_l2cap_coc_flow_control(p_l2cap_coc_rx_data->Channel_Index, 1);
          
          break;
        }
        /* USER CODE END ECODE_1 */
        default:
        {
          LOG_DEBUG_BLE("SVCCTL_App_Notification: unhandled EVT_VENDOR with opcode: 0x%02X\n", p_blecore_evt->ecode);
          /* USER CODE BEGIN ECODE_DEFAULT */

          /* USER CODE END ECODE_DEFAULT */
          break;
        }
      }
      /* USER CODE BEGIN EVT_VENDOR_1 */
      
      /* USER CODE END EVT_VENDOR_1 */
    }
    break; /* HCI_VENDOR_SPECIFIC_DEBUG_EVT_CODE */
    /* USER CODE BEGIN EVENT_PCKT */

    /* USER CODE END EVENT_PCKT */
    default:
    {
      LOG_DEBUG_BLE("SVCCTL_App_Notification: unhandled EVENT_PCKT with opcode: 0x%02X\n", p_event_pckt->evt);
      /* USER CODE BEGIN EVENT_PCKT_DEFAULT */

      /* USER CODE END EVENT_PCKT_DEFAULT */
      break;
    }
  }
  /* USER CODE BEGIN SVCCTL_App_Notification_1 */

  /* USER CODE END SVCCTL_App_Notification_1 */

  return (SVCCTL_UserEvtFlowEnable);
}

APP_BLE_ConnStatus_t APP_BLE_Get_Server_Connection_Status(void)
{
  return bleAppContext.Device_Connection_Status;
}

void Ble_UserEvtRx( void)
{
  SVCCTL_UserEvtFlowStatus_t svctl_return_status;
  BleEvtPacket_t *phcievt = NULL;

  LST_remove_head ( &BleAsynchEventQueue, (tListNode **)&phcievt );

  svctl_return_status = SVCCTL_UserEvtRx((void *)&(phcievt->evtserial));

  if (svctl_return_status != SVCCTL_UserEvtFlowDisable)
  {
    AMM_Free((uint32_t *)phcievt);
  }
  else
  {
    LST_insert_head ( &BleAsynchEventQueue, (tListNode *)phcievt );
  }

  if ((LST_is_empty(&BleAsynchEventQueue) == FALSE) && (svctl_return_status != SVCCTL_UserEvtFlowDisable) )
  {
    UTIL_SEQ_SetTask(1U << CFG_TASK_HCI_ASYNCH_EVT_ID, CFG_SEQ_PRIO_0);
  }

  /* Trigger BLE Host stack to process */
  BleStackCB_Process();

}

void APP_BLE_Procedure_Gap_General(ProcGapGeneralId_t ProcGapGeneralId)
{
  tBleStatus status;

  /* USER CODE BEGIN Procedure_Gap_General_1 */

  /* USER CODE END Procedure_Gap_General_1 */

  switch(ProcGapGeneralId)
  {
    case PROC_GAP_GEN_PHY_TOGGLE:
    {
      uint8_t phy_tx = 0U, phy_rx = 0U;

      status = hci_le_read_phy(bleAppContext.connectionHandle, &phy_tx, &phy_rx);

      if (status != BLE_STATUS_SUCCESS)
      {
        LOG_INFO_APP("hci_le_read_phy failure: reason=0x%02X\n",status);
      }
      else
      {
        LOG_INFO_APP("==>> hci_le_read_phy - Success\n");
        LOG_INFO_APP("==>> PHY Param  TX= %d, RX= %d\n", phy_tx, phy_rx);
        if ((phy_tx == HCI_TX_PHY_LE_2M) && (phy_rx == HCI_RX_PHY_LE_2M))
        {
          LOG_INFO_APP("==>> hci_le_set_phy PHY Param  TX= %d, RX= %d - ", HCI_TX_PHY_LE_1M, HCI_RX_PHY_LE_1M);
          status = hci_le_set_phy(bleAppContext.connectionHandle, 0, HCI_TX_PHYS_LE_1M_PREF, HCI_RX_PHYS_LE_1M_PREF, 0);
          if (status != BLE_STATUS_SUCCESS)
          {
            LOG_INFO_APP("Fail\n");
          }
          else
          {
            LOG_INFO_APP("Success\n");
            gap_cmd_resp_wait();/* waiting for HCI_LE_PHY_UPDATE_COMPLETE_SUBEVT_CODE */
          }
        }
        else
        {
          LOG_INFO_APP("==>> hci_le_set_phy PHY Param  TX= %d, RX= %d - ", HCI_TX_PHYS_LE_2M_PREF, HCI_RX_PHYS_LE_2M_PREF);
          status = hci_le_set_phy(bleAppContext.connectionHandle, 0, HCI_TX_PHYS_LE_2M_PREF, HCI_RX_PHYS_LE_2M_PREF, 0);
          if (status != BLE_STATUS_SUCCESS)
          {
            LOG_INFO_APP("Fail\n");
          }
          else
          {
            LOG_INFO_APP("Success\n");
            gap_cmd_resp_wait();/* waiting for HCI_LE_PHY_UPDATE_COMPLETE_SUBEVT_CODE */
          }
        }
      }
      break;
    }/* PROC_GAP_GEN_PHY_TOGGLE */
    case PROC_GAP_GEN_CONN_TERMINATE:
    {
      status = aci_gap_terminate(bleAppContext.connectionHandle, HCI_REMOTE_USER_TERMINATED_CONNECTION_ERR_CODE);
      if (status != BLE_STATUS_SUCCESS)
      {
         LOG_INFO_APP("aci_gap_terminate failure: reason=0x%02X\n", status);
      }
      else
      {
        LOG_INFO_APP("==>> aci_gap_terminate : Success\n");
        gap_cmd_resp_wait();/* waiting for HCI_DISCONNECTION_COMPLETE_EVT_CODE */
      }
      break;
    }/* PROC_GAP_GEN_CONN_TERMINATE */

    /* USER CODE BEGIN GAP_GENERAL */

    /* USER CODE END GAP_GENERAL */
    default:
      break;
  }

  /* USER CODE BEGIN Procedure_Gap_General_2 */

