STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA25CE/Applications/BLE/BLE_ESL/STM32_WPAN/App/app_ble.c
  /* USER CODE BEGIN Procedure_Gap_Peripheral_3 */
  if(ProcGapPeripheralId == PROC_GAP_PERIPH_ADVERTISE_STOP)
  {
    UTIL_TIMER_Stop(&(bleAppContext.TimerAdvLowPower_Id));
  }

  /* USER CODE END Procedure_Gap_Peripheral_3 */
  return;
}

const uint8_t* BleGetBdAddress(void)
{
  const uint8_t *p_bd_addr;

  p_bd_addr = (const uint8_t *)a_BdAddr;

  return p_bd_addr;
}

tBleStatus SetGapAppearance(uint16_t appearance)
{
  tBleStatus ret;

  ret = aci_gatt_update_char_value(bleAppContext.gapServiceHandle,
                                   bleAppContext.gapAppearanceCharHandle,
                                   0,
                                   2,
                                   (uint8_t *)&appearance);
  LOG_INFO_APP("Set appearance 0x%04X in GAP database with status %d\n", appearance, ret);

  return ret;
}

tBleStatus SetGapDeviceName(uint8_t *devicename, uint8_t devicename_len)
{
  tBleStatus ret;

  ret = aci_gatt_update_char_value(bleAppContext.gapServiceHandle,
                                   bleAppContext.gapDevNameCharHandle,
                                   0,
                                   devicename_len,
                                   devicename);
  LOG_INFO_APP("Set device name in GAP database with status %d\n", ret);

  return ret;
}

void APP_BLE_HostNvmStore(void)
{
  /* Start SNVMA write procedure */
  SNVMA_Write(APP_BLE_NvmBuffer, BLE_NvmCallback);
}

void BleStack_Process_BG(void)
{
  if (BleStack_Process() == 0x0)
  {
    BleStackCB_Process();
  }
}

/* USER CODE BEGIN FD */

void APP_BLE_StartAdvertising(bool fast_adv)
{
  tBleStatus status;
  Adv_Set_t adv_set = {
    .Advertising_Handle = 0,
    .Duration = 0,
    .Max_Extended_Advertising_Events = 0
  };
  uint8_t peer_address[6] = {0};
  uint32_t adv_interval_min, adv_interval_max;
  
  if(fast_adv)
  {
    adv_interval_min = ADV_INT_MS(ADV_INTERVAL_MIN);
    adv_interval_max = ADV_INT_MS(ADV_INTERVAL_MAX);
  }
  else
  {
    adv_interval_min = ADV_INT_MS(ADV_LP_INTERVAL_MIN);
    adv_interval_max = ADV_INT_MS(ADV_LP_INTERVAL_MAX);
  }
  
  status = aci_gap_adv_set_configuration_v2(0, /* Adv_Mode,*/
                                            0, /* Advertising_Handle */
                                            HCI_ADV_EVENT_PROP_CONNECTABLE|HCI_ADV_EVENT_PROP_SCANNABLE|HCI_ADV_EVENT_PROP_LEGACY, /* Adv_Event_Properties */
                                            adv_interval_min, /* Primary_Adv_Interval_Min */
                                            adv_interval_max, /* Primary_Adv_Interval_Max */
                                            0x07, /* Primary_Adv_Channel_Map */
                                            CFG_BD_ADDRESS_TYPE, /* Own_Address_Type */
                                            0, /*Peer_Address_Type */
                                            peer_address,
                                            ADV_FILTER, /* Adv_Filter_Policy, */
                                            127, /* Adv_TX_Power */
                                            HCI_TX_PHY_LE_1M, /* Primary_Adv_PHY */
                                            0, /* Secondary_Adv_Max_Skip */
                                            HCI_TX_PHY_LE_1M, /* Secondary_Adv_PHY */
                                            0, /* Adv_SID */
                                            0, /* Scan_Req_Notification_Enable */
                                            0, /* Primary_Adv_PHY_Options */
                                            0 ); /* Secondary_Adv_PHY_Options */
  if (status != BLE_STATUS_SUCCESS)
  {
    LOG_INFO_APP("==>> aci_gap_adv_set_configuration_v2 - fail, result: 0x%02X\n", status);
  }
  else
  {
    bleAppContext.Device_Connection_Status = APP_BLE_ADV_FAST;
    LOG_INFO_APP("==>> aci_gap_adv_set_configuration_v2 - Success\n");
  }
  
  /* Set Advertising data */  
  if(fast_adv)
  {
    UTIL_TIMER_Start(&(bleAppContext.TimerAdvLowPower_Id));
  }
  
  status = aci_gap_adv_set_adv_data(0, /* Advertising_Handle */
                                    HCI_SET_ADV_DATA_OPERATION_COMPLETE, /* Operation */
                                    0, /* Fragment_Preference */
                                    sizeof(a_CompleteAdvData),
                                    a_CompleteAdvData);
  if (status != BLE_STATUS_SUCCESS)
  {
    LOG_INFO_APP("==>> Failed to set advertising data, result: 0x%02X\n", status);
  }
  else
  {
    LOG_INFO_APP("==>> Advertising data set\n");
  }
  
  status = aci_gap_adv_set_enable(1, /* Enable */
                                  1, /* Num_Sets */
                                  &adv_set);
  
  if (status != BLE_STATUS_SUCCESS)
  {
    LOG_INFO_APP("==>> Start Advertising Failed, result: 0x%02X\n", status);
  }
  else
  {
    LOG_INFO_APP("==>> Success: Start Advertising\n");
  }
}

void APP_BLE_StopAdvertising(void)
{
  tBleStatus status;
  
  status = aci_gap_adv_set_enable(0, /* Enable */
                                  0, /* Num_Sets */
                                  NULL);
  if (status != BLE_STATUS_SUCCESS)
  {
    LOG_INFO_APP("Adv stop - fail, result: 0x%02X\n",status);
  }
  else
  {
    LOG_INFO_APP("==>> Adv stop - Success\n");
    if (bleAppContext.connectionHandle != 0xFFFF)
    {
      bleAppContext.Device_Connection_Status = APP_BLE_CONNECTED_SERVER;
    }
    else
    {
      bleAppContext.Device_Connection_Status = APP_BLE_IDLE;
    }
  }
  UTIL_TIMER_Stop(&(bleAppContext.TimerAdvLowPower_Id));
}

/* USER CODE END FD */

/*************************************************************
 *
 * LOCAL FUNCTIONS
 *
 *************************************************************/
static uint8_t HOST_BLE_Init(void)
{
  tBleStatus return_status;

  pInitParams.numAttrRecord           = CFG_BLE_NUM_GATT_ATTRIBUTES;
  pInitParams.numAttrServ             = CFG_BLE_NUM_GATT_SERVICES;
  pInitParams.attrValueArrSize        = CFG_BLE_ATT_VALUE_ARRAY_SIZE;
  pInitParams.prWriteListSize         = CFG_BLE_ATTR_PREPARE_WRITE_VALUE_SIZE;
  pInitParams.attMtu                  = CFG_BLE_ATT_MTU_MAX;
  pInitParams.max_coc_nbr             = CFG_BLE_COC_NBR_MAX;
  pInitParams.max_coc_mps             = CFG_BLE_COC_MPS_MAX;
  pInitParams.max_coc_initiator_nbr   = CFG_BLE_COC_INITIATOR_NBR_MAX;
  pInitParams.max_add_eatt_bearers    = CFG_BLE_EATT_BEARER_PER_LINK * CFG_BLE_NUM_LINK;
  pInitParams.numOfLinks              = CFG_BLE_NUM_LINK;
  pInitParams.mblockCount             = CFG_BLE_MBLOCK_COUNT;
  pInitParams.bleStartRamAddress      = (uint8_t*)host_buffer;
  pInitParams.total_buffer_size       = BLE_DYN_ALLOC_SIZE;
  pInitParams.bleStartRamAddress_GATT = (uint8_t*)gatt_buffer;
  pInitParams.total_buffer_size_GATT  = BLE_GATT_BUF_SIZE;
  pInitParams.extra_data_buffer_size  = CFG_BLE_EXTRA_DATA_BUF_SIZE;
  pInitParams.extra_data_buffer       = (uint8_t*)extra_data_buffer;
  pInitParams.gatt_long_write_buffer  = (uint8_t*)long_write_buffer;
  pInitParams.host_event_fifo_buffer  = host_event_buffer;
  pInitParams.host_event_fifo_buffer_size = DIVC(BLE_HOST_EVENT_BUF_SIZE, 2);
  pInitParams.nvm_cache_buffer        = host_nvm_buffer;
  pInitParams.nvm_cache_max_size      = CFG_BLE_NVM_SIZE_MAX;
  pInitParams.nvm_cache_size          = CFG_BLE_NVM_SIZE_MAX - 1;
  pInitParams.options                 = CFG_BLE_OPTIONS;
  pInitParams.debug                   = 0U;
/* USER CODE BEGIN HOST_BLE_Init_Params */

/* USER CODE END HOST_BLE_Init_Params */
  return_status = BleStack_Init(&pInitParams);
/* USER CODE BEGIN HOST_BLE_Init */

/* USER CODE END HOST_BLE_Init */
  return ((uint8_t)return_status);
}

static void Ble_Hci_Gap_Gatt_Init(void)
{
  uint8_t role;
  uint16_t gap_service_handle = 0U, gap_dev_name_char_handle = 0U, gap_appearance_char_handle = 0U;
  const uint8_t *p_bd_addr;
  uint16_t a_appearance[1] = {CFG_GAP_APPEARANCE};
  const uint8_t *p_ir_value;
  const uint8_t *p_er_value;
  tBleStatus ret;

  /* USER CODE BEGIN Ble_Hci_Gap_Gatt_Init */
  
  /* USER CODE END Ble_Hci_Gap_Gatt_Init */

  LOG_INFO_APP("==>> Start Ble_Hci_Gap_Gatt_Init function\n");

